Revit 2026 API

# DirectShapeTypeAddReferenceCurve(Curve, DirectShapeReferenceOptions) Method

---

Adds a reference curve to the DirectShapeType.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddReferenceCurve(
	Curve refCurve,
	DirectShapeReferenceOptions options
)
```
```vb
Public Sub AddReferenceCurve (
	refCurve As Curve,
	options As DirectShapeReferenceOptions
)
```
```cpp
public:
void AddReferenceCurve(
	Curve^ refCurve,
	DirectShapeReferenceOptions^ options
)
```
```fsharp
member AddReferenceCurve :
        refCurve : Curve *
        options : DirectShapeReferenceOptions -> unit
```

#### Parameters

refCurve Curve
     The geometry of the new reference curve.
options DirectShapeReferenceOptions
     The options that are used to configure the new reference curve.

| Exception | Condition |
| --- | --- |
| ArgumentException | refCurve cannot be used for creating a reference curve. -or- options cannot be used to add a reference object to this DirectShapeType. |
| ArgumentNullException | A non-optional argument was null |

There are two cases to consider:

  1. The input curve's bounds are set. The resulting reference curve that is added to the DirectShapeType will be displayed with those bounds. Note that the specified bounds must not be degenerate. Permitted curve types are those for which [!:Autodesk::Revit::DB::DirectShapeType::isValidReferenceCurve] returns true.
  2. The input curve is unbounded. Reasonable bounds are automatically calculated and applied to the input curve. The automatic bounds are based on the host DirectShapeType's geometry.

Note that only lines and splines may be unbounded. You must specify valid bounds for all other curve types.

#### Reference

DirectShapeType Class

AddReferenceCurve Overload

Autodesk.Revit.DB Namespace